app/controllers/line_items_controller.rb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "1"]]
---
  def find_line_item
    @line_item = LineItem.find(params[:id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "6"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sat, 26 Jan 2013 11:39:48 UTC +00:00], ["updated_at", Sat, 26 Jan 2013 11:39:48 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", nil], ["created_at", Sat, 26 Jan 2013 11:15:07 UTC +00:00], ["product_id", nil], ["updated_at", Sat, 26 Jan 2013 11:15:07 UTC +00:00]]
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save