app/controllers/orders_controller.rb

  def new
  @cart = current_cart
    if @cart.line_items.empty?
---
SELECT COUNT(*) FROM "line_items" WHERE "line_items"."cart_id" = 1

  def create
    @order = Order.new(params[:order])
    @order.add_items_from_cart(current_cart)
    respond_to do |format|
      if @order.save
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Thu, 14 Mar 2013 14:35:06 UTC +00:00], ["updated_at", Thu, 14 Mar 2013 14:35:06 UTC +00:00]]