app/controllers/store_controller.rb

SELECT description FROM "products"
---
  def index
    @products = Product.select([:title, :image_url, :description, :price, :id])