app/controllers/store_controller.rb

SELECT title, image_url, description, price, id FROM "products"
---
  def index
    @products = Product.order(:title).page params[:page]