app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "name", "password", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 14 Mar 2013 14:35:06 UTC +00:00], ["name", "MyString"], ["password", nil], ["password_digest", nil], ["updated_at", Thu, 14 Mar 2013 14:35:06 UTC +00:00]]
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save